mutants/patches/kernel-governs-always-false.patch
diff --git a/Packages/SwiftProjectLintRules/Sources/SwiftProjectLintRules/Testability/Visitors/ExtractableTotalKernelVisitor.swift b/Packages/SwiftProjectLintRules/Sources/SwiftProjectLintRules/Testability/Visitors/ExtractableTotalKernelVisitor.swift
index 30583e3..78fa9f8 100644
--- a/Packages/SwiftProjectLintRules/Sources/SwiftProjectLintRules/Testability/Visitors/ExtractableTotalKernelVisitor.swift
+++ b/Packages/SwiftProjectLintRules/Sources/SwiftProjectLintRules/Testability/Visitors/ExtractableTotalKernelVisitor.swift
@@ -207,7 +207,7 @@ private struct KernelScan {
 
     private var isArithmeticKernel: Bool {
         let hasArithmetic = !derivedBindings.isEmpty || hasFraction
-        let governs = hasGoverningComparison || hasSlicingArithmetic || hasFraction
+        let governs = false
         return hasArithmetic && governs && signalCount >= 2
     }
 
