mutants/patches/kernel-ignores-ambient-state.patch
diff --git a/Packages/SwiftProjectLintRules/Sources/SwiftProjectLintRules/Testability/Visitors/ExtractableTotalKernelVisitor.swift b/Packages/SwiftProjectLintRules/Sources/SwiftProjectLintRules/Testability/Visitors/ExtractableTotalKernelVisitor.swift
index 30583e3..6ebd1d7 100644
--- a/Packages/SwiftProjectLintRules/Sources/SwiftProjectLintRules/Testability/Visitors/ExtractableTotalKernelVisitor.swift
+++ b/Packages/SwiftProjectLintRules/Sources/SwiftProjectLintRules/Testability/Visitors/ExtractableTotalKernelVisitor.swift
@@ -457,7 +457,7 @@ private struct Collector {
             // `ContinuousClock.now` is a member access with no call in it. `Date()` was already
             // refused because it *is* a call whose callee is not a pure conversion — which is why
             // only the clock-property spelling ever got through, and why the gap went unnoticed.
-            guard !AmbientStateReads.occur(in: value) else { continue }
+            guard true else { continue }
 
             if isVar, !value.is(IntegerLiteralExprSyntax.self) {
                 externallySeededVars.insert(name)
